create_clock -period 50.000 -name clk -waveform {0.000 25.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.200 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.700 [get_ports reset]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {data_addr[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {data_addr[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {write_data[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports {write_data[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports mem_write]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.100 [get_ports mem_write]
